In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import zscore

In [3]:
bowl = pd.read_csv(r'C:/Users/PYTHON/InternSavy-Projects/Task 3/data/ball.csv')
bat = pd.read_csv(r'C:/Users/PYTHON/InternSavy-Projects/Task 3/data/bat.csv')
match = pd.read_csv(r'C:/Users/PYTHON/InternSavy-Projects/Task 3/data/match.csv')

In [4]:
bowl.head()

,Unnamed: 0,name_x,playing_role,id,order,run_conceded,maidens,wickets,overs,economy,...,matchtype,series_id,match_detail_id,title,runs,over,run_rate,match_id,opp_team_id,team_id
0,8526,Ajit Agarkar,BOWL,8544,2,51,0,2,10.0,5.10,...,odi,182,773,Bangladesh Innings,234,50.0,4.68,633,2,7
1,8518,Tapash Baisya,NaN,8536,0,67,0,2,10.0,6.70,...,odi,182,773,India Innings,245,50.0,4.90,633,7,2
2,8519,Mushfiqur Rahman,NaN,8537,1,29,0,1,6.0,4.83,...,odi,182,773,India Innings,245,50.0,4.90,633,7,2
3,8520,Nazmul Hossain,BOWL,8538,2,39,1,2,9.0,4.33,...,odi,182,773,India Innings,245,50.0,4.90,633,7,2
4,8521,Khaled Mahmud,NaN,8539,3,43,0,1,10.0,4.30,...,odi,182,773,India Innings,245,50.0,4.90,633,7,2

In [5]:
bat.head()

,Unnamed: 0,name_x,playing_role,id,order,runs_x,balls,strike_rate,fours,sixes,...,matchtype,series_id,match_detail_id,title,runs_y,over,run_rate,match_id,opp_team_id,team_id
0,13463,Tapash Baisya,NaN,13464,9,7,5,140.00,1,0,...,odi,182,773,Bangladesh Innings,234,50.0,4.68,633,2,7
1,13462,Khaled Mahmud,NaN,13463,8,21,17,123.52,3,0,...,odi,182,773,Bangladesh Innings,234,50.0,4.68,633,2,7
2,13459,Rajin Saleh,NaN,13460,5,14,28,50.00,1,0,...,odi,182,773,Bangladesh Innings,234,50.0,4.68,633,2,7
3,13461,Mushfiqur Rahman,NaN,13462,7,2,6,33.33,0,0,...,odi,182,773,Bangladesh Innings,234,50.0,4.68,633,2,7
4,13458,Aftab Ahmed,NaN,13459,4,30,49,61.22,2,1,...,odi,182,773,Bangladesh Innings,234,50.0,4.68,633,2,7

In [6]:
match.head()

,Unnamed: 0,match_number,name,start_date,matchtype,series_id,match_detail_id,scorecard_id,title,runs,over,run_rate,match_id,opp_team_id,team_id
0,1417,1.0,Bangladesh v India,2004-12-22 18:30:00+00:00,odi,182,773,1495,India Innings,245,50.0,4.90,633,7,2
1,1418,1.0,Bangladesh v India,2004-12-22 18:30:00+00:00,odi,182,773,1496,Bangladesh Innings,234,50.0,4.68,633,2,7
2,1419,2.0,Bangladesh v India,2004-12-25 18:30:00+00:00,odi,182,774,1497,Bangladesh Innings,229,50.0,4.58,634,2,7
3,1420,2.0,Bangladesh v India,2004-12-25 18:30:00+00:00,odi,182,774,1498,India Innings,214,47.5,4.47,634,7,2
4,1421,3.0,Bangladesh v India,2004-12-26 18:30:00+00:00,odi,182,775,1499,India Innings,348,50.0,6.96,635,7,2

## Data Wrangling

In [7]:
bowl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36149 entries, 0 to 36148
Data columns (total 30 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       36149 non-null  int64
 1   name_x           36149 non-null  object
 2   playing_role     34892 non-null  object
 3   id               36149 non-null  int64
 4   order            36149 non-null  int64
 5   run_conceded     36149 non-null  int64
 6   maidens          36149 non-null  int64
 7   wickets          36149 non-null  int64
 8   overs            36149 non-null  float64
 9   economy          36149 non-null  float64
 10  wides            36149 non-null  int64
 11  no_balls         36149 non-null  int64
 12  fours            15 non-null     float64
 13  sixes            15 non-null     float64
 14  zeros            15 non-null     float64
 15  player_id        36149 non-null  int64
 16  scorecard_id     36149 non-null  int64
 17  match_number     35713 non-null  float64
 18  name_y           36137 non-null  object
 19  start_date       36149 non-null  object
 20  matchtype        36133 non-null  object
 21  series_id        36149 non-null  int64
 22  match_detail_id  36149 non-null  int64
 23  title            36149 non-null  object
 24  runs             36149 non-null  int64
 25  over             36149 non-null  float64
 26  run_rate         36149 non-null  float64
 27  match_id         36149 non-null  int64
 28  opp_team_id      36149 non-null  int64
 29  team_id          36149 non-null  int64
dtypes: float64(8), int64(16), object(6)
memory usage: 8.3+ MB

In [8]:
bat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52492 entries, 0 to 52491
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           52492 non-null  int64
 1   name_x               52492 non-null  object
 2   playing_role         50949 non-null  object
 3   id                   52492 non-null  int64
 4   order                52492 non-null  int64
 5   runs_x               52492 non-null  int64
 6   balls                52492 non-null  int64
 7   strike_rate          52492 non-null  float64
 8   fours                52492 non-null  int64
 9   sixes                52492 non-null  int64
 10  how_out              52483 non-null  object
 11  fall_of_wicket       44 non-null     float64
 12  fall_of_wicket_over  52492 non-null  float64
 13  player_id            52492 non-null  int64
 14  scorecard_id         52492 non-null  int64
 15  match_number         51857 non-null  float64
 16  name_y               52479 non-null  object
 17  start_date           52492 non-null  object
 18  matchtype            52455 non-null  object
 19  series_id            52492 non-null  int64
 20  match_detail_id      52492 non-null  int64
 21  title                52492 non-null  object
 22  runs_y               52492 non-null  int64
 23  over                 52492 non-null  float64
 24  run_rate             52492 non-null  float64
 25  match_id             52492 non-null  int64
 26  opp_team_id          52492 non-null  int64
 27  team_id              52492 non-null  int64
dtypes: float64(6), int64(15), object(7)
memory usage: 11.2+ MB

In [9]:
match.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6199 entries, 0 to 6198
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       6199 non-null   int64
 1   match_number     6124 non-null   float64
 2   name             6197 non-null   object
 3   start_date       6199 non-null   object
 4   matchtype        6195 non-null   object
 5   series_id        6199 non-null   int64
 6   match_detail_id  6199 non-null   int64
 7   scorecard_id     6199 non-null   int64
 8   title            6199 non-null   object
 9   runs             6199 non-null   int64
 10  over             6199 non-null   float64
 11  run_rate         6199 non-null   float64
 12  match_id         6199 non-null   int64
 13  opp_team_id      6199 non-null   int64
 14  team_id          6199 non-null   int64
dtypes: float64(3), int64(8), object(4)
memory usage: 726.6+ KB